contactreq.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
	<soap:Header>
		<ABApplicationHeader xmlns="http://www.msn.com/webservices/AddressBook">
			<ApplicationId>996CDE1E-AA53-4477-B943-2BE802EA6166</ApplicationId>
			<IsMigration>false</IsMigration>
			<PartnerScenario>Initial</PartnerScenario>
		</ABApplicationHeader>
		<ABAuthHeader xmlns="http://www.msn.com/webservices/AddressBook">
			<ManagedGroupRequest>false</ManagedGroupRequest>
###TICKET
		</ABAuthHeader>
	</soap:Header>
	<soap:Body>
		<FindMembership xmlns="http://www.msn.com/webservices/AddressBook">
			<serviceFilter>
				<Types>
					<ServiceType>Messenger</ServiceType>
					<ServiceType>Invitation</ServiceType>
					<ServiceType>SocialNetwork</ServiceType>
					<ServiceType>Space</ServiceType>
					<ServiceType>Profile</ServiceType>
				</Types>
			</serviceFilter>
			<View xmlns="http://www.msn.com/webservices/AddressBook">Full</View>
			<deltasOnly xmlns="http://www.msn.com/webservices/AddressBook">true</deltasOnly>
###DATE
		</FindMembership>
	</soap:Body>
</soap:Envelope>
